Kevincoooool/N32G032/Software/FWLIB/inc/n32g032_gpio.h
/** @addtogroup GPIOx_Alternate_function_selection Alternate function selection
 * @{
 */

/*
 * Alternate function AF0
 */
#define GPIO_AF0        ((uint8_t)0x00U)
#define GPIO_AF0_SPI1   (GPIO_AF0)  /* SPI1 Alternate Function mapping */
#define GPIO_AF0_SPI2   (GPIO_AF0)  /* SPI2 Alternate Function mapping */ 
#define GPIO_AF0_SPI3   (GPIO_AF0)  /* SPI3 Alternate Function mapping */
#define GPIO_AF0_I2S1   (GPIO_AF0)  /* I2S1 Alternate Function mapping */
#define GPIO_AF0_TIM3   (GPIO_AF0)  /* TIM3 Alternate Function mapping */
#define GPIO_AF0_LPTIM  (GPIO_AF0)  /* LPTIM Alternate Function mapping */
#define GPIO_AF0_I2C2   (GPIO_AF0)  /* I2C2 Alternate Function mapping */
#define GPIO_AF0_SWD    (GPIO_AF0)  /* SWD Alternate Function mapping */
#define GPIO_AF0_OSC    (GPIO_AF0)  /* OSC Alternate Function mapping */ 

/*
 * Alternate function AF1
 */
#define GPIO_AF1          ((uint8_t)0x01U)
#define GPIO_AF1_USART1   (GPIO_AF1)  /* USART1 Alternate Function mapping */
#define GPIO_AF1_USART2   (GPIO_AF1)  /* USART2 Alternate Function mapping */
#define GPIO_AF1_LPUART1  (GPIO_AF1)  /* LPUART1 Alternate Function mapping */
#define GPIO_AF1_LPUART2  (GPIO_AF1)  /* LPUART2 Alternate Function mapping */
#define GPIO_AF1_TIM1     (GPIO_AF1)  /* TIM1 Alternate Function mapping */
#define GPIO_AF1_TIM8     (GPIO_AF1)  /* TIM8 Alternate Function mapping */
#define GPIO_AF1_TIM3     (GPIO_AF1)  /* TIM3 Alternate Function mapping */
#define GPIO_AF1_TIM4     (GPIO_AF1)  /* TIM4 Alternate Function mapping */
#define GPIO_AF1_SPI2     (GPIO_AF1)  /* SPI2 Alternate Function mapping */
#define GPIO_AF1_I2C1     (GPIO_AF1)  /* I2C1 Alternate Function mapping */
#define GPIO_AF1_RTC      (GPIO_AF1)  /* RTC Alternate Function mapping */

/*
 * Alternate function AF2
 */
#define GPIO_AF2          ((uint8_t)0x02U)
#define GPIO_AF2_TIM1 	  (GPIO_AF2)  /* TIM1 Alternate Function mapping */
#define GPIO_AF2_TIM8     (GPIO_AF2)  /* TIM8 Alternate Function mapping */
#define GPIO_AF2_TIM3     (GPIO_AF2)  /* TIM3 Alternate Function mapping */
#define GPIO_AF2_TIM4 	  (GPIO_AF2)  /* TIM4 Alternate Function mapping */
#define GPIO_AF2_LPUART1  (GPIO_AF2)  /* LPUART1 Alternate Function mapping */
#define GPIO_AF2_LPUART2  (GPIO_AF2)  /* LPUART2 Alternate Function mapping */
#define GPIO_AF2_UART5    (GPIO_AF2)  /* UART Alternate Function mapping */
#define GPIO_AF2_SPI2     (GPIO_AF2)  /* SPI2 Alternate Function mapping */
#define GPIO_AF2_CAN      (GPIO_AF2)  /* CAN Alternate Function mapping */  
#define GPIO_AF2_RTC      (GPIO_AF2)  /* RTC Alternate Function mapping */
#define GPIO_AF2_OSC      v  /* OSC Alternate Function mapping */

/*
 * Alternate function AF3
 */
#define GPIO_AF3          ((uint8_t)0x03U)
#define GPIO_AF3_TIM1     (GPIO_AF3)  /* TIM1 Alternate Function mapping */
#define GPIO_AF3_TIM8     (GPIO_AF3)  /* TIM8 Alternate Function mapping */
#define GPIO_AF3_TIM3     (GPIO_AF3)  /* TIM3 Alternate Function mapping */
#define GPIO_AF3_LPTIM    (GPIO_AF3)  /* LPTIM Alternate Function mapping */
#define GPIO_AF3_USART2   (GPIO_AF3)  /* USART2 Alternate Function mapping */
#define GPIO_AF3_LPUART1  (GPIO_AF3)  /* LPUART1 Alternate Function mapping */
#define GPIO_AF3_LPUART2  (GPIO_AF3)  /* LPUART2 Alternate Function mapping */
#define GPIO_AF3_EVENTOUT (GPIO_AF3)  /* EVENTOUT Alternate Function mapping */
#define GPIO_AF3_RTC      (GPIO_AF3)  /* RTC Alternate Function mapping */

/*
 * Alternate function AF4
 */
#define GPIO_AF4          ((uint8_t)0x04U)
#define GPIO_AF4_USART1   (GPIO_AF4)  /* USART1 Alternate Function mapping */ 
#define GPIO_AF4_USART2   (GPIO_AF4)  /* USART2 Alternate Function mapping */
#define GPIO_AF4_LPUART1  (GPIO_AF4)  /* LPUART1 Alternate Function mapping */
#define GPIO_AF4_UART5    (GPIO_AF4)  /* UART5 Alternate Function mapping */
#define GPIO_AF4_UART6    (GPIO_AF4)  /* UART6 Alternate Function mapping */
#define GPIO_AF4_TIM1     (GPIO_AF4)  /* TIM1 Alternate Function mapping */
#define GPIO_AF4_TIM8     (GPIO_AF4)  /* TIM8 Alternate Function mapping */
#define GPIO_AF4_TIM4     (GPIO_AF4)  /* TIM4 Alternate Function mapping */
#define GPIO_AF4_CAN      (GPIO_AF4)  /* CAN Alternate Function mapping */
#define GPIO_AF4_SPI3     (GPIO_AF4)  /* SPI3 Alternate Function mapping */ 

/*
 * Alternate function AF5
 */
#define GPIO_AF5          ((uint8_t)0x05U)
#define GPIO_AF5_USART2   (GPIO_AF5)  /* USART2 Alternate Function mapping */
#define GPIO_AF5_LPUART1  (GPIO_AF5)  /* LPUART1 Alternate Function mapping */
#define GPIO_AF5_LPUART2  (GPIO_AF5)  /* LPUART2 Alternate Function mapping */
#define GPIO_AF5_UART5    (GPIO_AF5)  /* UART5 Alternate Function mapping */
#define GPIO_AF5_TIM1     (GPIO_AF5)  /* TIM1 Alternate Function mapping */
#define GPIO_AF5_TIM8     (GPIO_AF5)  /* TIM8 Alternate Function mapping */ 
#define GPIO_AF5_TIM3     (GPIO_AF5)  /* TIM3 Alternate Function mapping */
#define GPIO_AF5_TIM4     (GPIO_AF5)  /* TIM4 Alternate Function mapping */
#define GPIO_AF5_SPI1     (GPIO_AF5)  /* SPI1 Alternate Function mapping */
#define GPIO_AF5_SPI3     (GPIO_AF5)  /* SPI3 Alternate Function mapping */
#define GPIO_AF5_COMP3    (GPIO_AF5)  /* COMP3 Alternate Function mapping */
#define GPIO_AF5_MCO      (GPIO_AF5)  /* RCC MCO Alternate Function mapping */ 

/*
 * Alternate function AF6
 */
#define GPIO_AF6          ((uint8_t)0x06U)
#define GPIO_AF6_USART1   (GPIO_AF6)  /* USART1 Alternate Function mapping */ 
#define GPIO_AF6_USART2   (GPIO_AF6)  /* USART2 Alternate Function mapping */
#define GPIO_AF6_LPUART1  (GPIO_AF6)  /* LPUART1 Alternate Function mapping */
#define GPIO_AF6_LPUART2  (GPIO_AF6)  /* LPUART2 Alternate Function mapping */
#define GPIO_AF6_UART5    (GPIO_AF6)  /* UART5 Alternate Function mapping */
#define GPIO_AF6_UART6    (GPIO_AF6)  /* UART6 Alternate Function mapping */
#define GPIO_AF6_I2C1     (GPIO_AF6)  /* I2C1 Alternate Function mapping */
#define GPIO_AF6_TIM4     (GPIO_AF6)  /* TIM4 Alternate Function mapping */
#define GPIO_AF6_SPI1     (GPIO_AF6)  /* SPI1 Alternate Function mapping */
#define GPIO_AF6_SPI3     (GPIO_AF6)  /* SPI3 Alternate Function mapping */

