Kevincoooool/N32G032/Software/FWLIB/inc/n32g032_gpio.h
/*
 * Alternate function AF7
 */
#define GPIO_AF7          ((uint8_t)0x07U)
#define GPIO_AF7_TIM8     (GPIO_AF7)  /* TIM8 Alternate Function mapping */ 
#define GPIO_AF7_LPTIM    (GPIO_AF7)  /* LPTIM Alternate Function mapping */
#define GPIO_AF7_I2C1     (GPIO_AF7)  /* I2C1 Alternate Function mapping */
#define GPIO_AF7_I2C2     (GPIO_AF7)  /* I2C2 Alternate Function mapping */
#define GPIO_AF7_EVENTOUT (GPIO_AF7)  /* EVENTOUT Alternate Function mapping */ 
#define GPIO_AF7_COMP3    (GPIO_AF7)  /* COMP3 Alternate Function mapping */ 
#define GPIO_AF7_BEEPER   (GPIO_AF7)  /* BEEPER Alternate Function mapping */

/*
 * Alternate function AF8
 */
#define GPIO_AF8          ((uint8_t)0x08U)
#define GPIO_AF8_COMP1    (GPIO_AF8)  /* COMP1 Alternate Function mapping */
#define GPIO_AF8_COMP2    (GPIO_AF8)  /* COMP2 Alternate Function mapping */
#define GPIO_AF8_EVENTOUT (GPIO_AF8)  /* EVENTOUT Alternate Function mapping */ 
#define GPIO_AF8_LPTIM    (GPIO_AF8)  /* LPTIM Alternate Function mapping */
#define GPIO_AF8_SPI2     (GPIO_AF8)  /* SPI2 Alternate Function mapping */
  
/*
 * Alternate function AF9
 */
#define GPIO_AF9          ((uint8_t)0x09U)
#define GPIO_AF9_RTC      (GPIO_AF9)  /* RTC Alternate Function mapping */
#define GPIO_AF9_TIM8     (GPIO_AF9)  /* TIM8 Alternate Function mapping */ 
#define GPIO_AF9_LPTIM    (GPIO_AF9)  /* LPTIM Alternate Function mapping */ 
#define GPIO_AF9_CAN      (GPIO_AF9)  /* CAN Alternate Function mapping */
#define GPIO_AF9_LPUART1  (GPIO_AF9)  /* LPUART1 Alternate Function mapping */
  
/*
 * Alternate function AF10
 */
#define GPIO_AF10           ((uint8_t)0x0AU)
#define GPIO_AF10_USART2    (GPIO_AF10)  /* USART2 Alternate Function mapping */
#define GPIO_AF10_LPUART1   (GPIO_AF10)  /* LPUART1 Alternate Function mapping */
#define GPIO_AF10_LPTIM     (GPIO_AF10)  /* LPTIM Alternate Function mapping */
#define GPIO_AF10_EVENTOUT  (GPIO_AF10)  /* EVENTOUT Alternate Function mapping */
#define GPIO_AF10_PVD       (GPIO_AF10)  /* PVD Alternate Function mapping */
 
/*
 * Alternate function AF11
 */
#define GPIO_AF11         ((uint8_t)0x0BU)
#define GPIO_AF11_LPUART1	(GPIO_AF11)  /* LPUART1 Alternate Function mapping */
#define GPIO_AF11_LPTIM   (GPIO_AF11)  /* LPTIM Alternate Function mapping */
#define GPIO_AF11_BEEPER  (GPIO_AF11)  /* BEEPER Alternate Function mapping */
#define GPIO_AF11_MCO     (GPIO_AF11)  /* RCC Alternate Function mapping */
#define GPIO_AF11_RTC     (GPIO_AF11)  /*RTC MCO Alternate Function mapping */

/*
 * Alternate function AF12
 */
#define GPIO_AF12       ((uint8_t)0x0CU)
#define GPIO_AF12_TIM3  (GPIO_AF12) /* TIM3 Alternate Function mapping */
#define GPIO_AF12_LPTIM (GPIO_AF12) /* LPTIM Alternate Function mapping */

/*
 * Alternate function AF13
 */
#define GPIO_AF13           ((uint8_t)0x0DU)
#define GPIO_AF13_TIM8      (GPIO_AF13) /* TIM8 Alternate Function mapping */
#define GPIO_AF13_EVENTOUT  (GPIO_AF13) /* ENENTOUT Alternate Function mapping */


#define GPIO_AF15   ((uint8_t)0x0FU)  /* NON Alternate Function mapping */
#define GPIO_NO_AF  (GPIO_AF15)
/**
  * @}
  */


/**
 *  IS_GPIO_AF macro definition
 */
#define IS_GPIO_AF(AF)         ((AF) <= (uint8_t)0x0FU) 
/**
 * @}
 */

/** @addtogroup AFIO_Remap_define
 * @{
 */
#define AFIO_RMP_TIM4CH2    (0x10000000UL)

#define IS_AFIO_REMAP(_RMP_) ((_RMP_) == AFIO_RMP_TIM4CH2)
/**
 * @}
 */

/** @defgroup GPIO Alternate function remaping
 * @{
 */
#define AFIO_I2C1_LV  (0x40000000UL)
#define AFIO_I2C2_LV  (0x20000000UL)
#define IS_AFIO_I2CX(_PARAMETER_) \
			(((_PARAMETER_) == AFIO_I2C1_LV) || ((_PARAMETER_) == AFIO_I2C2_LV))

#define AFIO_SPI1_NSS	(0x00400000UL)
#define AFIO_SPI2_NSS	(0x00800000UL)
#define AFIO_SPI3_NSS	(0x01000000UL)
#define IS_AFIO_SPIX(_PARAMETER_) \
			(((_PARAMETER_) == AFIO_SPI1_NSS) || ((_PARAMETER_) == AFIO_SPI2_NSS) || ((_PARAMETER_) == AFIO_SPI3_NSS))

#define AFIO_SPI_NSS_High_IMPEDANCE (0x0UL)
#define AFIO_SPI_NSS_High_LEVEL     (0x1UL)
#define IS_AFIO_SPI_NSS(_PARAMETER_) \
			(((_PARAMETER_) == AFIO_SPI_NSS_High_IMPEDANCE) ||((_PARAMETER_) == AFIO_SPI_NSS_High_LEVEL))

	
typedef enum
{
    AFIO_ADC_ETRI = 0U,
    AFIO_ADC_ETRR = 1U
}AFIO_ADC_ETRType;

typedef enum
{
	AFIO_ADC_TRIG_EXTI_0 = 0U,
	AFIO_ADC_TRIG_EXTI_1 = 1U,
	AFIO_ADC_TRIG_EXTI_2,
	AFIO_ADC_TRIG_EXTI_3,
	AFIO_ADC_TRIG_EXTI_4,
	AFIO_ADC_TRIG_EXTI_5,
	AFIO_ADC_TRIG_EXTI_6,
	AFIO_ADC_TRIG_EXTI_7,
	AFIO_ADC_TRIG_EXTI_8,
	AFIO_ADC_TRIG_EXTI_9,
	AFIO_ADC_TRIG_EXTI_10,
	AFIO_ADC_TRIG_EXTI_11,
	AFIO_ADC_TRIG_EXTI_12,
	AFIO_ADC_TRIG_EXTI_13,
	AFIO_ADC_TRIG_EXTI_14,
	AFIO_ADC_TRIG_EXTI_15,
	AFIO_ADC_TRIG_TIM8_TRGO,
	AFIO_ADC_TRIG_TIM8_CH4
}AFIO_ADC_Trig_RemapType;

#define IS_AFIO_ADC_ETR(_PARAMETER_) \
			(((_PARAMETER_) == AFIO_ADC_ETRI) ||((_PARAMETER_) == AFIO_ADC_ETRR))

#define IS_AFIO_ADC_ETRI(_PARAMETER_) \
			(((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_0) ||((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_1)|| \
			 ((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_2) ||((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_3)|| \
			 ((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_4) ||((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_5)|| \
			 ((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_6) ||((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_7)|| \
			 ((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_8) ||((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_9)|| \
			 ((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_10) ||((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_11)|| \
		 	 ((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_12) ||((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_13)|| \
			 ((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_14) ||((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_15)|| \
			 ((_PARAMETER_) == AFIO_ADC_TRIG_TIM8_CH4))

#define IS_AFIO_ADC_ETRR(_PARAMETER_) \
			(((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_0) ||((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_1)|| \
			 ((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_2) ||((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_3)|| \
			 ((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_4) ||((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_5)|| \
			 ((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_6) ||((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_7)|| \
			 ((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_8) ||((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_9)|| \
			 ((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_10) ||((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_11)|| \
			 ((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_12) ||((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_13) ||\
			 ((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_14) ||((_PARAMETER_) == AFIO_ADC_TRIG_EXTI_15)|| \
			  ((_PARAMETER_) == AFIO_ADC_TRIG_TIM8_TRGO))

 /**
 * @}
 */
 
/** @addtogroup GPIO_Exported_Macros
 * @{
 */

/**
 * @}
 */

/** @addtogroup GPIO_Exported_Functions
 * @{
 */

void GPIO_DeInit(GPIO_Module* GPIOx);
void GPIO_DeInitPin(GPIO_Module* GPIOx, uint32_t GPIO_Pin);
void GPIO_AFIOInitDefault(void);
void GPIO_InitPeripheral(GPIO_Module* GPIOx, GPIO_InitType* GPIO_InitStruct);
void GPIO_InitStruct(GPIO_InitType* GPIO_InitStruct);
uint8_t GPIO_ReadInputDataBit(GPIO_Module* GPIOx, uint16_t Pin);
uint16_t GPIO_ReadInputData(GPIO_Module* GPIOx);
uint8_t GPIO_ReadOutputDataBit(GPIO_Module* GPIOx, uint16_t Pin);
uint16_t GPIO_ReadOutputData(GPIO_Module* GPIOx);
void GPIO_SetBits(GPIO_Module* GPIOx, uint16_t Pin);
void GPIO_ResetBits(GPIO_Module* GPIOx, uint16_t Pin);
void GPIO_WriteBit(GPIO_Module* GPIOx, uint16_t Pin, Bit_OperateType BitCmd);
void GPIO_Write(GPIO_Module* GPIOx, uint16_t PortVal);
void GPIO_TogglePin(GPIO_Module* GPIOx, uint16_t Pin);
void GPIO_ConfigPinLock(GPIO_Module* GPIOx, uint16_t Pin);

void GPIO_ConfigEXTILine(uint8_t PortSource, uint8_t PinSource);
void GPIO_ConfigPinRemap(uint32_t RmpPin, FunctionalState Cmd);
void AFIO_EnableI2CLV(uint32_t AFIO_I2Cx_LV, FunctionalState Cmd);
void AFIO_ConfigSPINSSMode(uint32_t AFIO_SPIx_NSS, uint32_t SpiNssMode);
void AFIO_EnableTscOut(FunctionalState Cmd);
void AFIO_ConfigADCExternalTrigRemap(AFIO_ADC_ETRType ADCETRType, AFIO_ADC_Trig_RemapType ADCTrigRemap);

#ifdef __cplusplus
}
#endif

#endif /* __N32G032_GPIO_H__ */
/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */
